perftest/gin_main/gin_main_get.txt
[ GET /node 200][1]

Summary:
  Total:	60.0375 secs
  Slowest:	0.3778 secs
  Fastest:	0.0037 secs
  Average:	0.0305 secs
  Requests/sec:	1638.9761
  
  Total data:	141105600 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.004 [1]	|
  0.041 [79443]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.078 [13023]	|■■■■■■■
  0.116 [3999]	|■■
  0.153 [1281]	|■
  0.191 [451]	|
  0.228 [141]	|
  0.266 [37]	|
  0.303 [15]	|
  0.340 [6]	|
  0.378 [3]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0148 secs
  50% in 0.0220 secs
  75% in 0.0350 secs
  90% in 0.0614 secs
  95% in 0.0847 secs
  99% in 0.1383 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0037 secs, 0.3778 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0061 secs
  resp wait:	0.0304 secs, 0.0036 secs, 0.3777 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0066 secs

Status code distribution:
  [200]	98400 responses



[ GET /node 200][2]

Summary:
  Total:	60.0331 secs
  Slowest:	0.3622 secs
  Fastest:	0.0032 secs
  Average:	0.0307 secs
  Requests/sec:	1628.8010
  
  Total data:	140219388 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.039 [77159]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.075 [13945]	|■■■■■■■
  0.111 [4415]	|■■
  0.147 [1506]	|■
  0.183 [510]	|
  0.219 [154]	|
  0.254 [69]	|
  0.290 [11]	|
  0.326 [9]	|
  0.362 [3]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0222 secs
  75% in 0.0353 secs
  90% in 0.0618 secs
  95% in 0.0855 secs
  99% in 0.1390 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.3622 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0100 secs
  resp wait:	0.0306 secs, 0.0032 secs, 0.3621 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0056 secs

Status code distribution:
  [200]	97782 responses



[ GET /node 200][3]

Summary:
  Total:	60.0255 secs
  Slowest:	0.3480 secs
  Fastest:	0.0035 secs
  Average:	0.0304 secs
  Requests/sec:	1643.9180
  
  Total data:	141502818 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.004 [1]	|
  0.038 [77065]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.072 [14577]	|■■■■■■■■
  0.107 [4578]	|■■
  0.141 [1607]	|■
  0.176 [578]	|
  0.210 [198]	|
  0.245 [56]	|
  0.279 [12]	|
  0.314 [3]	|
  0.348 [2]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0148 secs
  50% in 0.0221 secs
  75% in 0.0350 secs
  90% in 0.0610 secs
  95% in 0.0843 secs
  99% in 0.1368 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0035 secs, 0.3480 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0044 secs
  resp wait:	0.0303 secs, 0.0035 secs, 0.3479 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200]	98677 responses



[ GET /node 200][4]

Summary:
  Total:	60.0218 secs
  Slowest:	0.3356 secs
  Fastest:	0.0036 secs
  Average:	0.0305 secs
  Requests/sec:	1637.6882
  
  Total data:	140957898 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.004 [1]	|
  0.037 [75123]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.070 [15648]	|■■■■■■■■
  0.103 [4825]	|■■■
  0.136 [1738]	|■
  0.170 [661]	|
  0.203 [190]	|
  0.236 [83]	|
  0.269 [23]	|
  0.302 [4]	|
  0.336 [1]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0223 secs
  75% in 0.0355 secs
  90% in 0.0609 secs
  95% in 0.0840 secs
  99% in 0.1358 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0036 secs, 0.3356 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0061 secs
  resp wait:	0.0304 secs, 0.0035 secs, 0.3355 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0109 secs

Status code distribution:
  [200]	98297 responses



[ GET /node 200][5]

Summary:
  Total:	60.0296 secs
  Slowest:	0.3818 secs
  Fastest:	0.0034 secs
  Average:	0.0306 secs
  Requests/sec:	1633.4455
  
  Total data:	140610870 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.041 [79415]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.079 [12620]	|■■■■■■
  0.117 [4046]	|■■
  0.155 [1405]	|■
  0.193 [384]	|
  0.230 [132]	|
  0.268 [37]	|
  0.306 [12]	|
  0.344 [2]	|
  0.382 [1]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0148 secs
  50% in 0.0221 secs
  75% in 0.0349 secs
  90% in 0.0615 secs
  95% in 0.0864 secs
  99% in 0.1388 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0034 secs, 0.3818 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0305 secs, 0.0034 secs, 0.3817 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0073 secs

Status code distribution:
  [200]	98055 responses



[ GET /node 400][1]

Summary:
  Total:	60.0264 secs
  Slowest:	0.3234 secs
  Fastest:	0.0034 secs
  Average:	0.0307 secs
  Requests/sec:	1626.7501
  
  Total data:	140027232 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.035 [73567]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.067 [15778]	|■■■■■■■■■
  0.099 [4884]	|■■■
  0.131 [2108]	|■
  0.163 [833]	|
  0.195 [306]	|
  0.227 [107]	|
  0.259 [41]	|
  0.291 [14]	|
  0.323 [9]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0221 secs
  75% in 0.0351 secs
  90% in 0.0613 secs
  95% in 0.0869 secs
  99% in 0.1403 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0034 secs, 0.3234 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0058 secs
  resp wait:	0.0306 secs, 0.0033 secs, 0.3233 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0058 secs

Status code distribution:
  [200]	97648 responses



[ GET /node 400][2]

Summary:
  Total:	60.0222 secs
  Slowest:	0.3625 secs
  Fastest:	0.0028 secs
  Average:	0.0307 secs
  Requests/sec:	1628.0484
  
  Total data:	140129046 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.039 [76757]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.075 [14192]	|■■■■■■■
  0.111 [4509]	|■■
  0.147 [1527]	|■
  0.183 [495]	|
  0.219 [158]	|
  0.255 [57]	|
  0.291 [15]	|
  0.327 [5]	|
  0.362 [3]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0222 secs
  75% in 0.0352 secs
  90% in 0.0615 secs
  95% in 0.0862 secs
  99% in 0.1381 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0028 secs, 0.3625 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0050 secs
  resp wait:	0.0306 secs, 0.0027 secs, 0.3624 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [200]	97719 responses



[ GET /node 400][3]

Summary:
  Total:	60.0228 secs
  Slowest:	0.3958 secs
  Fastest:	0.0035 secs
  Average:	0.0306 secs
  Requests/sec:	1633.0615
  
  Total data:	140562114 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.043 [80261]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.082 [12108]	|■■■■■■
  0.121 [3874]	|■■
  0.160 [1295]	|■
  0.200 [356]	|
  0.239 [82]	|
  0.278 [32]	|
  0.317 [7]	|
  0.357 [4]	|
  0.396 [1]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0148 secs
  50% in 0.0219 secs
  75% in 0.0349 secs
  90% in 0.0618 secs
  95% in 0.0870 secs
  99% in 0.1385 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0035 secs, 0.3958 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0046 secs
  resp wait:	0.0305 secs, 0.0034 secs, 0.3958 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0055 secs

Status code distribution:
  [200]	98021 responses



[ GET /node 400][4]

Summary:
  Total:	60.0232 secs
  Slowest:	0.3237 secs
  Fastest:	0.0032 secs
  Average:	0.0304 secs
  Requests/sec:	1642.4157
  
  Total data:	141368022 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.035 [74193]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.067 [16054]	|■■■■■■■■■
  0.099 [5243]	|■■■
  0.131 [2025]	|■
  0.163 [703]	|
  0.196 [258]	|
  0.228 [74]	|
  0.260 [24]	|
  0.292 [6]	|
  0.324 [2]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0149 secs
  50% in 0.0222 secs
  75% in 0.0350 secs
  90% in 0.0612 secs
  95% in 0.0848 secs
  99% in 0.1341 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.3237 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0056 secs
  resp wait:	0.0303 secs, 0.0031 secs, 0.3237 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	98583 responses



[ GET /node 400][5]

Summary:
  Total:	60.0182 secs
  Slowest:	0.3883 secs
  Fastest:	0.0029 secs
  Average:	0.0306 secs
  Requests/sec:	1634.4722
  
  Total data:	140672532 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.041 [79346]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.080 [13073]	|■■■■■■■
  0.119 [3947]	|■■
  0.157 [1176]	|■
  0.196 [416]	|
  0.234 [94]	|
  0.273 [29]	|
  0.311 [10]	|
  0.350 [2]	|
  0.388 [4]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0149 secs
  50% in 0.0223 secs
  75% in 0.0352 secs
  90% in 0.0608 secs
  95% in 0.0850 secs
  99% in 0.1378 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0029 secs, 0.3883 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0096 secs
  resp wait:	0.0305 secs, 0.0028 secs, 0.3882 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0097 secs

Status code distribution:
  [200]	98098 responses



[ GET /node 600][1]

Summary:
  Total:	60.0232 secs
  Slowest:	0.3120 secs
  Fastest:	0.0032 secs
  Average:	0.0310 secs
  Requests/sec:	1614.2927
  
  Total data:	138947430 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.034 [71102]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.065 [16818]	|■■■■■■■■■
  0.096 [5123]	|■■■
  0.127 [2368]	|■
  0.158 [921]	|■
  0.188 [368]	|
  0.219 [129]	|
  0.250 [46]	|
  0.281 [13]	|
  0.312 [6]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0224 secs
  75% in 0.0354 secs
  90% in 0.0621 secs
  95% in 0.0875 secs
  99% in 0.1404 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.3120 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0060 secs
  resp wait:	0.0309 secs, 0.0031 secs, 0.3119 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	96895 responses



[ GET /node 600][2]

Summary:
  Total:	60.0194 secs
  Slowest:	0.3196 secs
  Fastest:	0.0030 secs
  Average:	0.0310 secs
  Requests/sec:	1609.8117
  
  Total data:	138553080 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.035 [71506]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.066 [16355]	|■■■■■■■■■
  0.098 [5159]	|■■■
  0.130 [2186]	|■
  0.161 [849]	|
  0.193 [357]	|
  0.225 [128]	|
  0.256 [57]	|
  0.288 [20]	|
  0.320 [2]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0150 secs
  50% in 0.0223 secs
  75% in 0.0354 secs
  90% in 0.0625 secs
  95% in 0.0876 secs
  99% in 0.1425 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.3196 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0057 secs
  resp wait:	0.0310 secs, 0.0029 secs, 0.3195 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [200]	96620 responses



[ GET /node 600][3]

Summary:
  Total:	60.0324 secs
  Slowest:	0.3021 secs
  Fastest:	0.0031 secs
  Average:	0.0314 secs
  Requests/sec:	1593.8716
  
  Total data:	137210856 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.033 [67548]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.063 [18370]	|■■■■■■■■■■■
  0.093 [5842]	|■■■
  0.123 [2415]	|■
  0.153 [958]	|■
  0.182 [341]	|
  0.212 [128]	|
  0.242 [58]	|
  0.272 [20]	|
  0.302 [3]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0152 secs
  50% in 0.0229 secs
  75% in 0.0365 secs
  90% in 0.0635 secs
  95% in 0.0864 secs
  99% in 0.1361 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0031 secs, 0.3021 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0053 secs
  resp wait:	0.0313 secs, 0.0030 secs, 0.3020 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0055 secs

Status code distribution:
  [200]	95684 responses



[ GET /node 600][4]

Summary:
  Total:	60.0295 secs
  Slowest:	0.3111 secs
  Fastest:	0.0023 secs
  Average:	0.0309 secs
  Requests/sec:	1616.7716
  
  Total data:	139175436 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.002 [1]	|
  0.033 [69927]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.064 [18002]	|■■■■■■■■■■
  0.095 [5325]	|■■■
  0.126 [2283]	|■
  0.157 [926]	|■
  0.188 [398]	|
  0.218 [132]	|
  0.249 [44]	|
  0.280 [13]	|
  0.311 [3]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0150 secs
  50% in 0.0224 secs
  75% in 0.0355 secs
  90% in 0.0619 secs
  95% in 0.0863 secs
  99% in 0.1410 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0023 secs, 0.3111 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0054 secs
  resp wait:	0.0308 secs, 0.0022 secs, 0.3110 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0053 secs

Status code distribution:
  [200]	97054 responses



[ GET /node 600][5]

Summary:
  Total:	60.0177 secs
  Slowest:	0.3218 secs
  Fastest:	0.0033 secs
  Average:	0.0310 secs
  Requests/sec:	1614.8234
  
  Total data:	138980412 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.035 [72146]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.067 [16231]	|■■■■■■■■■
  0.099 [5259]	|■■■
  0.131 [2063]	|■
  0.163 [801]	|
  0.194 [276]	|
  0.226 [101]	|
  0.258 [32]	|
  0.290 [5]	|
  0.322 [3]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0150 secs
  50% in 0.0225 secs
  75% in 0.0357 secs
  90% in 0.0624 secs
  95% in 0.0864 secs
  99% in 0.1371 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0033 secs, 0.3218 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0309 secs, 0.0030 secs, 0.3217 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	96918 responses



[ GET /node 800][1]

Summary:
  Total:	60.0212 secs
  Slowest:	0.3587 secs
  Fastest:	0.0032 secs
  Average:	0.0307 secs
  Requests/sec:	1625.6412
  
  Total data:	139919682 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.039 [76677]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.074 [13983]	|■■■■■■■
  0.110 [4548]	|■■
  0.145 [1622]	|■
  0.181 [465]	|
  0.217 [180]	|
  0.252 [73]	|
  0.288 [16]	|
  0.323 [4]	|
  0.359 [4]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0149 secs
  50% in 0.0222 secs
  75% in 0.0352 secs
  90% in 0.0617 secs
  95% in 0.0862 secs
  99% in 0.1376 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.3587 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0056 secs
  resp wait:	0.0307 secs, 0.0031 secs, 0.3586 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	97573 responses



[ GET /node 800][2]

Summary:
  Total:	60.0278 secs
  Slowest:	0.4438 secs
  Fastest:	0.0028 secs
  Average:	0.0316 secs
  Requests/sec:	1582.0833
  
  Total data:	136185546 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.047 [79293]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.091 [11277]	|■■■■■■
  0.135 [3171]	|■■
  0.179 [900]	|
  0.223 [237]	|
  0.267 [65]	|
  0.311 [19]	|
  0.356 [2]	|
  0.400 [2]	|
  0.444 [2]	|


Latency distribution:
  10% in 0.0111 secs
  25% in 0.0153 secs
  50% in 0.0228 secs
  75% in 0.0363 secs
  90% in 0.0632 secs
  95% in 0.0880 secs
  99% in 0.1442 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0028 secs, 0.4438 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0315 secs, 0.0027 secs, 0.4437 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200]	94969 responses



[ GET /node 800][3]

Summary:
  Total:	60.0240 secs
  Slowest:	0.3408 secs
  Fastest:	0.0032 secs
  Average:	0.0309 secs
  Requests/sec:	1615.6035
  
  Total data:	139062150 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.037 [74430]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.071 [14761]	|■■■■■■■■
  0.104 [4849]	|■■■
  0.138 [1892]	|■
  0.172 [713]	|
  0.206 [210]	|
  0.240 [70]	|
  0.273 [29]	|
  0.307 [16]	|
  0.341 [4]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0223 secs
  75% in 0.0354 secs
  90% in 0.0627 secs
  95% in 0.0875 secs
  99% in 0.1406 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.3408 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0067 secs
  resp wait:	0.0309 secs, 0.0031 secs, 0.3407 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0056 secs

Status code distribution:
  [200]	96975 responses



[ GET /node 800][4]

Summary:
  Total:	60.0219 secs
  Slowest:	0.4044 secs
  Fastest:	0.0030 secs
  Average:	0.0313 secs
  Requests/sec:	1597.6998
  
  Total data:	137516298 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.043 [77993]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.083 [12609]	|■■■■■■
  0.123 [3618]	|■■
  0.164 [1158]	|■
  0.204 [379]	|
  0.244 [99]	|
  0.284 [31]	|
  0.324 [7]	|
  0.364 [1]	|
  0.404 [1]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0151 secs
  50% in 0.0226 secs
  75% in 0.0359 secs
  90% in 0.0627 secs
  95% in 0.0868 secs
  99% in 0.1428 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.4044 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0050 secs
  resp wait:	0.0312 secs, 0.0030 secs, 0.4043 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0052 secs

Status code distribution:
  [200]	95897 responses



[ GET /node 800][5]

Summary:
  Total:	60.0259 secs
  Slowest:	0.3757 secs
  Fastest:	0.0037 secs
  Average:	0.0306 secs
  Requests/sec:	1631.3469
  
  Total data:	140421582 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.004 [1]	|
  0.041 [78827]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.078 [12989]	|■■■■■■■
  0.115 [4085]	|■■
  0.152 [1405]	|■
  0.190 [442]	|
  0.227 [125]	|
  0.264 [38]	|
  0.301 [4]	|
  0.339 [3]	|
  0.376 [4]	|


Latency distribution:
  10% in 0.0108 secs
  25% in 0.0149 secs
  50% in 0.0222 secs
  75% in 0.0352 secs
  90% in 0.0613 secs
  95% in 0.0857 secs
  99% in 0.1388 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0037 secs, 0.3757 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0306 secs, 0.0036 secs, 0.3756 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0067 secs

Status code distribution:
  [200]	97923 responses



[ GET /node 1000][1]

Summary:
  Total:	60.0268 secs
  Slowest:	0.2929 secs
  Fastest:	0.0035 secs
  Average:	0.0308 secs
  Requests/sec:	1621.3265
  
  Total data:	139561182 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.004 [1]	|
  0.032 [69039]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.061 [18527]	|■■■■■■■■■■■
  0.090 [5489]	|■■■
  0.119 [2461]	|■
  0.148 [1119]	|■
  0.177 [435]	|
  0.206 [173]	|
  0.235 [51]	|
  0.264 [22]	|
  0.293 [6]	|


Latency distribution:
  10% in 0.0109 secs
  25% in 0.0149 secs
  50% in 0.0224 secs
  75% in 0.0356 secs
  90% in 0.0615 secs
  95% in 0.0860 secs
  99% in 0.1381 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0035 secs, 0.2929 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0308 secs, 0.0035 secs, 0.2929 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [200]	97323 responses



[ GET /node 1000][2]

Summary:
  Total:	60.0271 secs
  Slowest:	0.3312 secs
  Fastest:	0.0036 secs
  Average:	0.0312 secs
  Requests/sec:	1599.9613
  
  Total data:	137722794 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.004 [1]	|
  0.036 [72604]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [15512]	|■■■■■■■■■
  0.102 [4819]	|■■■
  0.135 [1934]	|■
  0.167 [745]	|
  0.200 [248]	|
  0.233 [133]	|
  0.266 [36]	|
  0.298 [6]	|
  0.331 [3]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0152 secs
  50% in 0.0227 secs
  75% in 0.0358 secs
  90% in 0.0627 secs
  95% in 0.0866 secs
  99% in 0.1408 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0036 secs, 0.3312 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0312 secs, 0.0036 secs, 0.3311 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0062 secs

Status code distribution:
  [200]	96041 responses



[ GET /node 1000][3]

Summary:
  Total:	60.0360 secs
  Slowest:	0.3371 secs
  Fastest:	0.0030 secs
  Average:	0.0314 secs
  Requests/sec:	1593.2271
  
  Total data:	137163534 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.036 [72437]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.070 [15122]	|■■■■■■■■
  0.103 [4910]	|■■■
  0.137 [1991]	|■
  0.170 [784]	|
  0.203 [264]	|
  0.237 [92]	|
  0.270 [34]	|
  0.304 [12]	|
  0.337 [4]	|


Latency distribution:
  10% in 0.0110 secs
  25% in 0.0151 secs
  50% in 0.0225 secs
  75% in 0.0358 secs
  90% in 0.0634 secs
  95% in 0.0886 secs
  99% in 0.1441 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0030 secs, 0.3371 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0313 secs, 0.0029 secs, 0.3371 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0089 secs

Status code distribution:
  [200]	95651 responses



[ GET /node 1000][4]

Summary:
  Total:	60.0295 secs
  Slowest:	0.4708 secs
  Fastest:	0.0038 secs
  Average:	0.0323 secs
  Requests/sec:	1548.2052
  
  Total data:	133273092 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.004 [1]	|
  0.051 [78959]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.097 [10086]	|■■■■■
  0.144 [2821]	|■
  0.191 [755]	|
  0.237 [227]	|
  0.284 [64]	|
  0.331 [20]	|
  0.377 [4]	|
  0.424 [0]	|
  0.471 [1]	|


Latency distribution:
  10% in 0.0112 secs
  25% in 0.0155 secs
  50% in 0.0232 secs
  75% in 0.0370 secs
  90% in 0.0644 secs
  95% in 0.0905 secs
  99% in 0.1496 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0038 secs, 0.4708 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0056 secs
  resp wait:	0.0322 secs, 0.0037 secs, 0.4707 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0055 secs

Status code distribution:
  [200]	92938 responses



[ GET /node 1000][5]

Summary:
  Total:	60.0210 secs
  Slowest:	0.3713 secs
  Fastest:	0.0032 secs
  Average:	0.0323 secs
  Requests/sec:	1546.2745
  
  Total data:	133088106 bytes
  Size/request:	1434 bytes

Response time histogram:
  0.003 [1]	|
  0.040 [72193]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.077 [13835]	|■■■■■■■■
  0.114 [4326]	|■■
  0.150 [1597]	|■
  0.187 [569]	|
  0.224 [213]	|
  0.261 [53]	|
  0.298 [17]	|
  0.334 [3]	|
  0.371 [2]	|


Latency distribution:
  10% in 0.0113 secs
  25% in 0.0156 secs
  50% in 0.0232 secs
  75% in 0.0371 secs
  90% in 0.0652 secs
  95% in 0.0908 secs
  99% in 0.1478 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0032 secs, 0.3713 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0322 secs, 0.0031 secs, 0.3712 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0092 secs

Status code distribution:
  [200]	92809 responses